app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
  def index
    @projects = Project.all

INSERT INTO `projects` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2014-05-26 05:46:47', '<p>this is sample project</p>', 'project ', '2014-05-26 05:46:47')
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE `projects` SET `description` = '<p>dskfdsfdfsf</p>', `updated_at` = '2014-05-26 08:03:40' WHERE `projects`.`id` = 18
---
  def update
    respond_to do |format|
      if @project.update(project_params)

SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 18 LIMIT 1
---
    def set_project
      @project = Project.find(params[:id])